---
kind: other
id: Methods.T:Autodesk.Revit.DB.BaseArray
source: html/93cf6d8f-6cea-bc4c-2d49-eafe528e9872.htm
---
# BaseArray Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.